export const vindictusHeroes = new Map<string, string[]>([
  ["Lethita", ["", "", "", "", ""]],
  ["Fiona", ["", "", "", "", ""]],
  ["Evy", ["占星術", "深沉之心", "遠程射擊", "淨化一擊", "元素魔法師"]],
  ["Kalok", ["", "", "", "", "無畏巨人"]],
  ["Kay", ["", "", "", "", ""]],
  ["Vella", ["", "", "", "", ""]],
  ["Hurk", ["航海術", "堅韌耐性", "超凡之勢", "巨型武器", "浪人劍客"]],
  ["Lynn", ["華麗身世", "止水月步", "神出鬼沒", "淨化一擊", "花瓣誓言"]],
  ["Arisha", ["闇之明瞳", "野生動物知識", "神出鬼沒", "先發制人", "時空支配者"]],
  ["Hagie", ["", "", "", "", ""]],
  ["Delia", ["華麗身世", "堅韌耐性", "鋒利之刃", "巨型武器", "信念守護者"]],
  ["Miri", ["", "", "", "", ""]],
  ["Grimden", ["", "", "", "", ""]],
  ["Miul", ["航海術", "深沉之心", "神出鬼沒", "遠程射擊", "空間魔女"]],
  ["Bel", ["鐵胃", "止水月步", "先發制人", "巨型武器", "時間的漂流者"]],
  ["Lethor", ["占星術", "卓越平衡", "謹慎戰術", "連續打擊", "黎明氏族"]],
  ["Kael", ["華麗身世", "堅韌耐性", "鋒利之刃", "連續打擊", "正義使者"]],
  ["Tessa", ["卓越平衡", "闇之明瞳", "連續打擊", "復仇之影", "愛恨交織的獵人"]],
  ["Danah", ["占星術", "堅韌耐性", "神出鬼沒", "淨化一擊", "靈魂武士"]],
  ["Letty", ["航海術", "卓越平衡", "遠程射擊", "巨型武器", "爆炸愛好者"]],
  ["Latiya", ["止水月步", "野生動物知識", "謹慎戰術", "巨型武器", "高潔的獵人"]],
  ["Czern", ["占星術", "深沉之心", "謹慎戰術", "遠程射擊", "黎明魔女"]],
  ["Achel", ["鐵胃", "野生動物知識", "連續打擊", "先發制人", "赤犬"]],
])

export interface Hero {
  name: string
  specialties: string[]
}

const names = new Map<string, string>([
  ["Lethita", "利斯塔"],
  ["Fiona", "菲歐娜"],
  ["Evy", "依菲"],
  ["Kalok", "卡魯"],
  ["Kay", "凱"],
  ["Vella", "薇拉"],
  ["Hurk", "赫克"],
  ["Lynn", "玲"],
  ["Arisha", "艾瑞莎"],
  ["Hagie", "赫基"],
  ["Delia", "蒂莉亞"],
  ["Miri", "彌莉"],
  ["Grimden", "葛嵐頓"],
  ["Miul", "繆兒"],
  ["Bel", "蓓爾"],
  ["Lethor", "璃朔"],
  ["Kael", "凱爾"],
  ["Tessa", "泰莎"],
  ["Danah", "丹雅"],
  ["Letty", "蕾媞"],
  ["Latiya", "拉緹雅"],
  ["Czern", "泫兒"],
  ["Achel", "阿刻洛"],
])

export function getName(id: string): string {
  return names.get(id) ?? id
}
